Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/hooks-state_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: hooks-state title: Using the State Hook permalink: docs/hooks-state.html next: hooks-effect.html prev: hooks-overview.html ---
ja: --- id: hooks-state title: ステートフックの利用法 permalink: docs/hooks-state.html next: hooks-effect.html prev: hooks-overview.html ---

source: *Hooks* are a new addition in React 16.8.
ja: *フック (hook)* は React 16.8 で追加された新機能です。

source: They let you use state and other React features without writing a class.
ja: state などの React の機能を、クラスを書かずに使えるようになります。

source: The [introduction page](/docs/hooks-intro.html) used this example to get familiar with Hooks:
ja: [フックの導入のページ](/docs/hooks-intro.html)で以下の例を挙げてフックの紹介を行いました：

source: We'll start learning about Hooks by comparing this code to an equivalent class example.
ja: このコードをクラスによる等価版と比較しながらフックについて学び始めましょう。

source: ## Equivalent Class Example {#equivalent-class-example}
ja: ## クラスによる同等の例 {#equivalent-class-example}

source: If you used classes in React before, this code should look familiar:
ja: 以前 React でクラスを使っていたなら、このコードに馴染みがあるでしょう。

source: The state starts as `{ count: 0 }`, and we increment `state.count` when the user clicks a button by calling `this.setState()`.
ja: state は `{ count: 0 }` から始まり、ユーザがボタンをクリックした時に `this.setState()` を呼ぶことで `state.count` をインクリメントします。

source: We'll use snippets from this class throughout the page.
ja: このページの全体にわたってこのクラスからの例が出てきます。

source: >Note > >You might be wondering why we're using a counter here instead of a more realistic example.
ja: > 補足 > > もっと現実的な例ではなくカウンタを使っているのはなぜか気になるかもしれません。

source: This is to help us focus on the API while we're still making our first steps with Hooks.
ja: フックについての第一歩の説明ですので API にフォーカスするためです。

source: ## Hooks and Function Components {#hooks-and-function-components}
ja: ## フックと関数コンポーネント {#hooks-and-function-components}

source: As a reminder, function components in React look like this:
ja: 念のため、React の関数コンポーネントとはこのようなものです：

source: or this:
ja: あるいはこのようなものです：

source: You might have previously known these as "stateless components".
ja: これらのことを「ステートレスコンポーネント (stateless component)」だと理解していたかもしれません。

source: We're now introducing the ability to use React state from these, so we prefer the name "function components".
ja: 今からこれらの内部で React の state を利用できるようにしているので、「関数コンポーネント (function component)」という名前を使用しましょう。

source: Hooks **don't** work inside classes.
ja: フックはクラスの内部では動作**しません**。

source: But you can use them instead of writing classes.
ja: クラスを書く代わりに使うものです。

source: ## What's a Hook?
ja: ## フックとは何か？

source: Our new example starts by importing the `useState` Hook from React:
ja: この新しい例では、React から `useState` をインポートするところから始めましょう。

source: **What is a Hook?** A Hook is a special function that lets you "hook into" React features.
ja: **フックとは何？** フックとは React の機能に「接続 (hook into)」するための特別な関数です。

source: For example, `useState` is a Hook that lets you add React state to function components.
ja: 例えば `useState` によって React の state の機能を関数コンポーネントに追加できます。

source: We'll learn other Hooks later.
ja: 他のフックについても後で学びます。

source: **When would I use a Hook?** If you write a function component and realize you need to add some state to it, previously you had to convert it to a class.
ja: **フックをいつ使うべき？** 関数コンポーネントを書いていて state が必要だと気付いた場合、これまではコンポーネントをクラスに変換する必要がありました。

source: Now you can use a Hook inside the existing function component.
ja: 今後は、既に書いた関数コンポーネントの中でフックを使うことができます。

source: We're going to do that right now!
ja: 早速やってみましょう！

source: >Note: > >There are some special rules about where you can and can't use Hooks within a component.
ja: > 補足： > > コンポーネント内のどこでフックが使えてどこで使えないかに関する特別なルールがあります。

source: We'll learn them in [Rules of Hooks](/docs/hooks-rules.html).
ja: これについては[フックのルール](/docs/hooks-rules.html)で学びます。

source: ## Declaring a State Variable {#declaring-a-state-variable}
ja: ## state 変数の宣言 {#declaring-a-state-variable}

source: In a class, we initialize the `count` state to `0` by setting `this.state` to `{ count: 0 }` in the constructor:
ja: クラスでは、コンストラクタ内で `this.state` を `{ count: 0 }` にセットするという方法で、state である `count` を `0` へと初期化します。

source: In a function component, we have no `this`, so we can't assign or read `this.state`.
ja: 関数コンポーネントには `this` は存在しませんので、`this.state` を読み書きすることはできません。

source: Instead, we call the `useState` Hook directly inside our component:
ja: その代わりに、コンポーネントの内部で直接 `useState` フックを使いましょう。

source: **What does calling `useState` do?** It declares a "state variable".
ja: **`useState` を呼ぶと何が起きるの？** これにより『state 変数』が宣言されます。

source: Our variable is called `count` but we could call it anything else, like `banana`.
ja: 我々の例では変数を `count` と名付けましたが、`banana` でも何でも好きな名前にすることができます。

source: This is a way to "preserve" some values between the function calls — `useState` is a new way to use the exact same capabilities that `this.state` provides in a class.
ja: これが関数コールの間で値を『保持』しておくための方法です ― `useState` は、クラスにおいて `this.state` が提供するのと全く同じ機能を実現するための新しい方法です。

source: Normally, variables "disappear" when the function exits but state variables are preserved by React.
ja: 通常、関数が終了すると変数は『消えて』しまいますが、state 変数は React によって保持されます。

source: **What do we pass to `useState` as an argument?** The only argument to the `useState()` Hook is the initial state.
ja: **引数として `useState` に何を渡すのか？** `useState()` フックの唯一の引数は state の初期値です。

source: Unlike with classes, the state doesn't have to be an object.
ja: クラスの場合とは異なり、state はオブジェクトである必要はありません。

source: We can keep a number or a string if that's all we need.
ja: 数字や文字列が欲しいだけであればそれらを保持することができます。

source: In our example, we just want a number for how many times the user clicked, so pass `0` as initial state for our variable.
ja: 我々の例ではユーザがクリックした回数に対応する数字が欲しいだけですので、`0` を state 変数の初期値として渡します（もし違う値を保持したい場合は `useState()` を 2 回呼ぶことになります）。

source: (If we wanted to store two different values in state, we would call `useState()` twice.)
ja: **`useState` は何を返すのか？

source: **What does `useState` return?** It returns a pair of values: the current state and a function that updates it.
ja: ** 現在の state と、それを更新するための関数とを、ペアにして返します。

source: This is why we write `const [count, setCount] = useState()`.
ja: これが `const [count, setCount] = useState()` という書き方をした理由です。

source: This is similar to `this.state.count` and `this.setState` in a class, except you get them in a pair.
ja: これはクラスにおける `this.state.count` と `this.setState` に似ていますが、それをペアとして手に入れる点が異なります。

source: If you're not familiar with the syntax we used, we'll come back to it [at the bottom of this page](/docs/hooks-state.html#tip-what-do-square-brackets-mean).
ja: もしもここで使った構文になじみがない場合は、[このページの下部](/docs/hooks-state.html#tip-what-do-square-brackets-mean)で改めて説明します。

source: Now that we know what the `useState` Hook does, our example should make more sense:
ja: `useState` が何をやるのかが分かったので、最初の例の意味がより分かりやすくなりました：

source: We declare a state variable called `count`, and set it to `0`.
ja: `count` という名前の state 変数を宣言しており、それを `0` にセットします。

source: React will remember its current value between re-renders, and provide the most recent one to our function.
ja: 再レンダー間で React はその変数の現在値を記憶しており、最新の値を関数に渡します。

source: If we want to update the current `count`, we can call `setCount`.
ja: 現在の `count` の値を更新したい場合は、`setCount` を呼ぶことができます。

source: >Note > >You might be wondering: why is `useState` not named `createState` instead?
ja: > 補足 > > どうして `createState` ではなく `useState` という名前なのか気になるでしょうか？

source: > >"Create" wouldn't be quite accurate because the state is only created the first time our component renders.
ja: > > state が「作成」されるのはコンポーネントの初回レンダー時だけですので、`createState` という名前はあまり正確ではありません。

source: During the next renders, `useState` gives us the current state.
ja: 次回以降のレンダー時には、`useState` からは既存の state の現在値を受け取ります。

source: Otherwise it wouldn't be "state" at all!
ja: 毎回作成していたのではそもそも「状態」になりませんね。

source: There's also a reason why Hook names *always* start with `use`.
ja: また、フックの名前が*常に* `use` から始まることには理由があります。

source: We'll learn why later in the [Rules of Hooks](/docs/hooks-rules.html).
ja: [フックのルール](/docs/hooks-rules.html)で改めて説明します。

source: ## Reading State {#reading-state}
ja: ## state の読み出し {#reading-state}

source: When we want to display the current count in a class, we read `this.state.count`:
ja: クラス内で現在のカウント値を表示したい場合、`this.state.count` を読み出します：

source: In a function, we can use `count` directly:
ja: 関数内では、直接 `count` を使うことができます：

source: ## Updating State {#updating-state}
ja: ## state の更新 {#updating-state}

source: In a class, we need to call `this.setState()` to update the `count` state:
ja: クラスでは、`this.setState()` を呼ぶことで `count` ステートを更新します：

source: In a function, we already have `setCount` and `count` as variables so we don't need `this`:
ja: 関数内では、すでに `setCount` と `count` を変数として受け取っていますので、`this` は必要ありません：

source: ## Recap {#recap}
ja: ## まとめ {#recap}

source: Let's now **recap what we learned line by line** and check our understanding.
ja: では**これまで学んだことを 1 行ずつまとめて**、理解を確認しましょう。

source: * **Line 1:** We import the `useState` Hook from React.
ja: - **1 行目：** `useState` フックを React からインポートします。

source: It lets us keep local state in a function component.
ja: これにより関数コンポーネント内でローカル state が使えるようにになります。

source: * **Line 4:** Inside the `Example` component, we declare a new state variable by calling the `useState` Hook.
ja: - **4 行目：** `Example` コンポーネント内で `useState` フックを呼び出すことで新しい state 変数を宣言します。

source: It returns a pair of values, to which we give names.
ja: 2 つの値のペアが返されるので、それらに名前を与えます。

source: We're calling our variable `count` because it holds the number of button clicks.
ja: ボタンのクリック回数を保持するための変数ですので `count` と名付けましょう。

source: We initialize it to zero by passing `0` as the only `useState` argument.
ja: `useState` 唯一の引数として `0` を渡すことで、変数をゼロへと初期化します。

source: The second returned item is itself a function.
ja: 返り値の 2 つ目はそれ自体が関数です。

source: It lets us update the `count` so we'll name it `setCount`.
ja: これにより `count` を更新するので、`setCount` という名前にします。

source: * **Line 9:** When the user clicks, we call `setCount` with a new value.
ja: - **9 行目：** ユーザがクリックした時に、新しい値で `setCount` を呼びます。

source: React will then re-render the `Example` component, passing the new `count` value to it.
ja: React は `Example` コンポーネントを再レンダーし、その際には新たな `count` の値を渡します。

source: This might seem like a lot to take in at first.
ja: 最初は飲み込むのに時間がかかるかもしれません。

source: Don't rush it!
ja: 急がないようにしましょう！

source: If you're lost in the explanation, look at the code above again and try to read it from top to bottom.
ja: 途中で分からなくなった場合は上記のコードを最初から最後まで読み直してください。

source: We promise that once you try to "forget" how state works in classes, and look at this code with fresh eyes, it will make sense.
ja: 一旦クラスで state がどう動くのかを「忘れて」新鮮な目でこのコードを見るようにすれば、必ず理解できるようになるはずです。

source: ### Tip: What Do Square Brackets Mean?
ja: ### ヒント：この角カッコの意味は？

source: You might have noticed the square brackets when we declare a state variable:
ja: state 変数を宣言するときのこの角カッコに気付かれたでしょうか：

source: The names on the left aren't a part of the React API.
ja: 左辺に書かれている名前は、React の API の一部ではありません。

source: You can name your own state variables:
ja: state 変数には好きな名前を付けることができます：

source: This JavaScript syntax is called ["array destructuring"](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Destructuring_assignment#Array_destructuring).
ja: この JavaScript の構文は ["分割代入 (destructuring)"](https://developer.mozilla.org/en-US/docs/Web/JavaScript/Reference/Operators/Destructuring_assignment#Array_destructuring) と呼ばれています。

source: It means that we're making two new variables `fruit` and `setFruit`, where `fruit` is set to the first value returned by `useState`, and `setFruit` is the second.
ja: これが意味するところは、`fruit` と `setFruit` という名前の 2 つの変数を作って、`useState` から返される値のうち 1 つ目を `fruit` に、2 つ目を `setFruit` に代入する、ということです。

source: It is equivalent to this code:
ja: これは以下のコードと等価です：

source: When we declare a state variable with `useState`, it returns a pair — an array with two items.
ja: `useState` で state 変数を宣言する際、ペア、つまり 2 つの要素を含んだ配列が返されます。

source: The first item is the current value, and the second is a function that lets us update it.
ja: 1 つ目の要素は state の現在の値、2 つ目の要素はそれを更新するための関数です。

source: Using `[0]` and `[1]` to access them is a bit confusing because they have a specific meaning.
ja: これらには特定の意味があるので、アクセスするのに `[0]` や `[1]` を使うのではちょっと分かりづらくなります。

source: This is why we use array destructuring instead.
ja: だから代わりに分割代入を使うというわけです。

source: >Note > >You might be curious how React knows which component `useState` corresponds to since we're not passing anything like `this` back to React.
ja: > 補足 > > React に対して `this` のようなものを一切渡していないので、どのようにコンポーネントと `useState` の呼び出しの対応を知るのか不思議に思うかもしれません。

source: We'll answer [this question](/docs/hooks-faq.html#how-does-react-associate-hook-calls-with-components) and many others in the FAQ section.
ja: FAQ セクションで、[この質問](/docs/hooks-faq.html#how-does-react-associate-hook-calls-with-components)およびその他の疑問についてお答えしています。

source: ### Tip: Using Multiple State Variables {#tip-using-multiple-state-variables}
ja: ### ヒント：複数の state 変数を使う {#tip-using-multiple-state-variables}

source: Declaring state variables as a pair of `[something, setSomething]` is also handy because it lets us give *different* names to different state variables if we want to use more than one:
ja: state 変数の宣言を `[something, setSomething]` のペアの形で行うのが便利であるもうひとつの理由は、state 変数を複数使いたくなった場合にそれらに*異なる*名前をつけることができるからです：

source: In the above component, we have `age`, `fruit`, and `todos` as local variables, and we can update them individually:
ja: 上記の例では、ローカル変数として `age`、`fruit`、`todos` があり、それぞれを個別に更新することができます。

source: You **don't have to** use many state variables.
ja: たくさんの state 変数を使う**必要は**ありません。

source: State variables can hold objects and arrays just fine, so you can still group related data together.
ja: state 変数はオブジェクトや配列も何ら問題なく保持できますので、関連する値をいっしょにまとめておくこともできます。

source: However, unlike `this.setState` in a class, updating a state variable always *replaces* it instead of merging it.
ja: しかしクラスでの `this.setState` とは異なり、state 変数の更新は、マージではなく必ず古い値を*置換*します。

source: We provide more recommendations on splitting independent state variables [in the FAQ](/docs/hooks-faq.html#should-i-use-one-or-many-state-variables).
ja: 独立した state 変数を分割する際の推奨事項については [FAQ で](/docs/hooks-faq.html#should-i-use-one-or-many-state-variables)詳しく述べています。

source: ## Next Steps {#next-steps}
ja: ## 次のステップ {#next-steps}

source: On this page we've learned about one of the Hooks provided by React, called `useState`.
ja: このページでは React によって提供されるフックのうちのひとつである `useState` について学びました。

source: We're also sometimes going to refer to it as the "State Hook".
ja: これからは「ステートフック」という名前でも呼ぶことにします。

source: It lets us add local state to React function components -- which we did for the first time ever!
ja: ステートフックによって、React の歴史上はじめて、React の関数コンポーネントにローカル state を加えることができます！

source: We also learned a little bit more about what Hooks are.
ja: またフックが一体何なのかについても少々学びました。

source: Hooks are functions that let you "hook into" React features from function components.
ja: フックとは関数コンポーネント内から React の機能に「接続する (hook into)」ための関数のことです。

source: Their names always start with `use`, and there are more Hooks we haven't seen yet.
ja: フックの名前は必ず `use` から始まり、他にもまだ説明していない様々なフックがあります。

source: **Now let's continue by [learning the next Hook: `useEffect`.](/docs/hooks-effect.html)** It lets you perform side effects in components, and is similar to lifecycle methods in classes.
ja: **それでは[次のフックである `useEffect` について学びましょう。](/docs/hooks-effect.html)**これらはクラスにおけるライフサイクルメソッドと似ており、コンポーネント内で副作用を実行することができるようにするものです。
